apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_i2s.h
#define I2S_RX_CONF_REG(i)          (REG_I2S_BASE(i) + 0x20)

/* I2S_RX_PDM_SINC_DSR_16_EN : R/W ;bitpos:[22] ;default: 1'h0 ; */

/* Description: Configure the down sampling rate of PDM RX filter group1
 * module.
 * 1: The  down sa mpling rate is 128.
 * 0: down sampling rate is 64.
 */

#define I2S_RX_PDM_SINC_DSR_16_EN    (BIT(22))
#define I2S_RX_PDM_SINC_DSR_16_EN_M  (BIT(22))
#define I2S_RX_PDM_SINC_DSR_16_EN_V  0x1
#define I2S_RX_PDM_SINC_DSR_16_EN_S  22

/* I2S_RX_PDM2PCM_EN : R/W ;bitpos:[21] ;default: 1'h0 ; */

/* Description:
 * 1: Enable PDM2PCM RX mode.
 * 0: DIsable.
 */

#define I2S_RX_PDM2PCM_EN    (BIT(21))
#define I2S_RX_PDM2PCM_EN_M  (BIT(21))
#define I2S_RX_PDM2PCM_EN_V  0x1
#define I2S_RX_PDM2PCM_EN_S  21

/* I2S_RX_PDM_EN : R/W ;bitpos:[20] ;default: 1'h0 ; */

/* Description:
 * 1: Enable I2S PDM Rx mode.
 * 0: Disable.
 */

#define I2S_RX_PDM_EN    (BIT(20))
#define I2S_RX_PDM_EN_M  (BIT(20))
#define I2S_RX_PDM_EN_V  0x1
#define I2S_RX_PDM_EN_S  20

/* I2S_RX_TDM_EN : R/W ;bitpos:[19] ;default: 1'h0 ; */

/* Description:
 * 1: Enable I2S TDM Rx mode.
 * 0: Disable.
 */

#define I2S_RX_TDM_EN    (BIT(19))
#define I2S_RX_TDM_EN_M  (BIT(19))
#define I2S_RX_TDM_EN_V  0x1
#define I2S_RX_TDM_EN_S  19

/* I2S_RX_BIT_ORDER : R/W ;bitpos:[18] ;default: 1'h0 ; */

/* Description: I2S Rx bit endian. 1:small endian, the LSB is received
 * first. 0:big endian, the MSB is received first..
 */

#define I2S_RX_BIT_ORDER    (BIT(18))
#define I2S_RX_BIT_ORDER_M  (BIT(18))
#define I2S_RX_BIT_ORDER_V  0x1
#define I2S_RX_BIT_ORDER_S  18

/* I2S_RX_WS_IDLE_POL : R/W ;bitpos:[17] ;default: 1'h0 ; */

/* Description:
 * 0: WS should be 0 when receiving left channel data,
 * and WS is 1in right channel.
 * 1: WS should be 1 when receiving left channel data, and WS is 0
 * in right channel.
 */

#define I2S_RX_WS_IDLE_POL    (BIT(17))
#define I2S_RX_WS_IDLE_POL_M  (BIT(17))
#define I2S_RX_WS_IDLE_POL_V  0x1
#define I2S_RX_WS_IDLE_POL_S  17

/* I2S_RX_24_FILL_EN : R/W ;bitpos:[16] ;default: 1'h0 ; */

/* Description:
 * 1: store 24 channel bits to 32 bits.
 * 0: store 24 channel bits to 24 bits.
 */

#define I2S_RX_24_FILL_EN    (BIT(16))
#define I2S_RX_24_FILL_EN_M  (BIT(16))
#define I2S_RX_24_FILL_EN_V  0x1
#define I2S_RX_24_FILL_EN_S  16

/* I2S_RX_LEFT_ALIGN : R/W ;bitpos:[15] ;default: 1'b1 ; */

/* Description:
 * 1: I2S RX left alignment mode.
 * 0: I2S RX right alignment mode..
 */

#define I2S_RX_LEFT_ALIGN    (BIT(15))
#define I2S_RX_LEFT_ALIGN_M  (BIT(15))
#define I2S_RX_LEFT_ALIGN_V  0x1
#define I2S_RX_LEFT_ALIGN_S  15

/* I2S_RX_STOP_MODE : R/W ;bitpos:[14:13] ;default: 2'd0 ; */

/* Description:
 * 0: I2S Rx only stop when reg_rx_start is cleared.
 * 1: Stop when reg_rx_start is 0 or in_suc_eof is 1.
 * 2:  Stop I2S RX when reg_rx_start is 0 or RX FIFO is full.
 */

#define I2S_RX_STOP_MODE    0x00000003
#define I2S_RX_STOP_MODE_M  ((I2S_RX_STOP_MODE_V)<<(I2S_RX_STOP_MODE_S))
#define I2S_RX_STOP_MODE_V  0x3
#define I2S_RX_STOP_MODE_S  13

/* I2S_RX_PCM_BYPASS : R/W ;bitpos:[12] ;default: 1'h1 ; */

/* Description: Set this bit to bypass Compress/Decompress module
 * for received data..
 */

#define I2S_RX_PCM_BYPASS    (BIT(12))
#define I2S_RX_PCM_BYPASS_M  (BIT(12))
#define I2S_RX_PCM_BYPASS_V  0x1
#define I2S_RX_PCM_BYPASS_S  12

/* I2S_RX_PCM_CONF : R/W ;bitpos:[11:10] ;default: 2'h1 ; */

/* Description: I2S RX compress/decompress configuration bit.
 * 0 (atol): A-Law decompress,
 * 1 (ltoa) : A-Law compress,
 * 2 (utol) : u-Law decompress,
 * 3 (ltou) : u-Law compress.
 */

#define I2S_RX_PCM_CONF    0x00000003
#define I2S_RX_PCM_CONF_M  ((I2S_RX_PCM_CONF_V)<<(I2S_RX_PCM_CONF_S))
#define I2S_RX_PCM_CONF_V  0x3
#define I2S_RX_PCM_CONF_S  10

/* I2S_RX_MONO_FST_VLD : R/W ;bitpos:[9] ;default: 1'b1 ; */

/* Description:
 * 1: The first channel data value is valid in I2S RX mono mode.
 * 0: The second channel data value is valid in I2S RX mono mode.
 */

#define I2S_RX_MONO_FST_VLD    (BIT(9))
#define I2S_RX_MONO_FST_VLD_M  (BIT(9))
#define I2S_RX_MONO_FST_VLD_V  0x1
#define I2S_RX_MONO_FST_VLD_S  9

/* I2S_RX_UPDATE : R/W/SC ;bitpos:[8] ;default: 1'b0 ; */

/* Description:
 * Set 1 to update I2S RX registers from APB clock domain to I2S RX clock
 * domain. This bit will be cleared by hardware after update register
 * done.
 */

#define I2S_RX_UPDATE    (BIT(8))
#define I2S_RX_UPDATE_M  (BIT(8))
#define I2S_RX_UPDATE_V  0x1
#define I2S_RX_UPDATE_S  8

/* I2S_RX_BIG_ENDIAN : R/W ;bitpos:[7] ;default: 1'b0 ; */

/* Description:
 * I2S Rx byte endian
 * 1: low addr value to high addr.
 * 0: low addr with low addr value.
 */

#define I2S_RX_BIG_ENDIAN    (BIT(7))
#define I2S_RX_BIG_ENDIAN_M  (BIT(7))
#define I2S_RX_BIG_ENDIAN_V  0x1
#define I2S_RX_BIG_ENDIAN_S  7

/* I2S_RX_MONO : R/W ;bitpos:[5] ;default: 1'b0 ; */

/* Description: Set this bit to enable receiver  in mono mode. */

#define I2S_RX_MONO    (BIT(5))
#define I2S_RX_MONO_M  (BIT(5))
#define I2S_RX_MONO_V  0x1
#define I2S_RX_MONO_S  5

/* I2S_RX_SLAVE_MOD : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: Set this bit to enable slave receiver mode. */

#define I2S_RX_SLAVE_MOD    (BIT(3))
#define I2S_RX_SLAVE_MOD_M  (BIT(3))
#define I2S_RX_SLAVE_MOD_V  0x1
#define I2S_RX_SLAVE_MOD_S  3

/* I2S_RX_START : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: Set this bit to start receiving data. */

#define I2S_RX_START    (BIT(2))
#define I2S_RX_START_M  (BIT(2))
#define I2S_RX_START_V  0x1
#define I2S_RX_START_S  2

/* I2S_RX_FIFO_RESET : WT ;bitpos:[1] ;default: 1'b0 ; */

/* Description: Set this bit to reset Rx AFIFO. */

#define I2S_RX_FIFO_RESET    (BIT(1))
#define I2S_RX_FIFO_RESET_M  (BIT(1))
#define I2S_RX_FIFO_RESET_V  0x1
#define I2S_RX_FIFO_RESET_S  1

/* I2S_RX_RESET : WT ;bitpos:[0] ;default: 1'b0 ; */

/* Description: Set this bit to reset receiver. */

#define I2S_RX_RESET    (BIT(0))
#define I2S_RX_RESET_M  (BIT(0))
#define I2S_RX_RESET_V  0x1
#define I2S_RX_RESET_S  0

#define I2S_TX_CONF_REG(i)          (REG_I2S_BASE(i) + 0x24)

/* I2S_SIG_LOOPBACK : R/W ;bitpos:[27] ;default: 1'b0 ; */

/* Description:
 * Enable signal loop back mode with transmitter module and receiver
 * module sharing the same WS and BCK signals.
 */

