apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_i2s.h
#define I2S_SIG_LOOPBACK    (BIT(27))
#define I2S_SIG_LOOPBACK_M  (BIT(27))
#define I2S_SIG_LOOPBACK_V  0x1
#define I2S_SIG_LOOPBACK_S  27

/* I2S_TX_CHAN_MOD : R/W ;bitpos:[26:24] ;default: 3'b0 ; */

/* Description: I2S transmitter channel mode configuration bits. */

#define I2S_TX_CHAN_MOD    0x00000007
#define I2S_TX_CHAN_MOD_M  ((I2S_TX_CHAN_MOD_V)<<(I2S_TX_CHAN_MOD_S))
#define I2S_TX_CHAN_MOD_V  0x7
#define I2S_TX_CHAN_MOD_S  24

/* I2S_TX_PDM_EN : R/W ;bitpos:[20] ;default: 1'h0 ; */

/* Description:
 * 1: Enable I2S PDM Tx mode
 * 0: Disable.
 */

#define I2S_TX_PDM_EN    (BIT(20))
#define I2S_TX_PDM_EN_M  (BIT(20))
#define I2S_TX_PDM_EN_V  0x1
#define I2S_TX_PDM_EN_S  20

/* I2S_TX_TDM_EN : R/W ;bitpos:[19] ;default: 1'h0 ; */

/* Description:
 * 1: Enable I2S TDM Tx mode
 * 0: Disable.
 */

#define I2S_TX_TDM_EN    (BIT(19))
#define I2S_TX_TDM_EN_M  (BIT(19))
#define I2S_TX_TDM_EN_V  0x1
#define I2S_TX_TDM_EN_S  19

/* I2S_TX_BIT_ORDER : R/W ;bitpos:[18] ;default: 1'h0 ; */

/* Description: I2S Tx bit endian.
 * 1:small endian, the LSB is sent first.
 * 0:big endian, the MSB is sent first.
 */

#define I2S_TX_BIT_ORDER    (BIT(18))
#define I2S_TX_BIT_ORDER_M  (BIT(18))
#define I2S_TX_BIT_ORDER_V  0x1
#define I2S_TX_BIT_ORDER_S  18

/* I2S_TX_WS_IDLE_POL : R/W ;bitpos:[17] ;default: 1'h0 ; */

/* Description:
 * 0: WS should be 0 when sending left channel data, and WS is 1 in
 * right channel.
 * 1: WS should be 1 when sending left channel data, and WS is 0 in
 * right channel.
 */

#define I2S_TX_WS_IDLE_POL    (BIT(17))
#define I2S_TX_WS_IDLE_POL_M  (BIT(17))
#define I2S_TX_WS_IDLE_POL_V  0x1
#define I2S_TX_WS_IDLE_POL_S  17

/* I2S_TX_24_FILL_EN : R/W ;bitpos:[16] ;default: 1'h0 ; */

/* Description:
 * 1: Sent 32 bits in 24 channel bits mode.
 * 0: Sent 24 bits in 24 channel bits mode.
 */

#define I2S_TX_24_FILL_EN    (BIT(16))
#define I2S_TX_24_FILL_EN_M  (BIT(16))
#define I2S_TX_24_FILL_EN_V  0x1
#define I2S_TX_24_FILL_EN_S  16

/* I2S_TX_LEFT_ALIGN : R/W ;bitpos:[15] ;default: 1'h1 ; */

/* Description: 1: I2S TX left alignment mode. 0: I2S TX right
 * alignment mode.
 */

#define I2S_TX_LEFT_ALIGN    (BIT(15))
#define I2S_TX_LEFT_ALIGN_M  (BIT(15))
#define I2S_TX_LEFT_ALIGN_V  0x1
#define I2S_TX_LEFT_ALIGN_S  15

/* I2S_TX_STOP_EN : R/W ;bitpos:[13] ;default: 1'h1 ; */

/* Description: Set this bit to stop disable output BCK signal and WS
 * signal when tx FIFO is empty.
 */

#define I2S_TX_STOP_EN    (BIT(13))
#define I2S_TX_STOP_EN_M  (BIT(13))
#define I2S_TX_STOP_EN_V  0x1
#define I2S_TX_STOP_EN_S  13

/* I2S_TX_PCM_BYPASS : R/W ;bitpos:[12] ;default: 1'h1 ; */

/* Description: Set this bit to bypass Compress/Decompress module for
 * transmitted data.
 */

#define I2S_TX_PCM_BYPASS    (BIT(12))
#define I2S_TX_PCM_BYPASS_M  (BIT(12))
#define I2S_TX_PCM_BYPASS_V  0x1
#define I2S_TX_PCM_BYPASS_S  12

/* I2S_TX_PCM_CONF : R/W ;bitpos:[11:10] ;default: 2'h0 ; */

/* Description: I2S TX compress/decompress configuration bit.
 *  0 (atol): A-Law decompress,
 *  1 (ltoa) : A-Law compress,
 *  2 (utol) : u-Law decompress,
 *  3 (ltou) : u-Law compress.
 */

#define I2S_TX_PCM_CONF    0x00000003
#define I2S_TX_PCM_CONF_M  ((I2S_TX_PCM_CONF_V)<<(I2S_TX_PCM_CONF_S))
#define I2S_TX_PCM_CONF_V  0x3
#define I2S_TX_PCM_CONF_S  10

/* I2S_TX_MONO_FST_VLD : R/W ;bitpos:[9] ;default: 1'b1 ; */

/* Description:
 * 1: The first channel data value is valid in I2S TX mono mode.
 * 0: The second channel data value is valid in I2S TX mono mode.
 */

#define I2S_TX_MONO_FST_VLD    (BIT(9))
#define I2S_TX_MONO_FST_VLD_M  (BIT(9))
#define I2S_TX_MONO_FST_VLD_V  0x1
#define I2S_TX_MONO_FST_VLD_S  9

/* I2S_TX_UPDATE : R/W/SC ;bitpos:[8] ;default: 1'b0 ; */

/* Description:
 * Set 1 to update I2S TX registers from APB clock domain to I2S TX
 * clock domain. This bit will be cleared by hardware after update
 * register done.
 */

#define I2S_TX_UPDATE    (BIT(8))
#define I2S_TX_UPDATE_M  (BIT(8))
#define I2S_TX_UPDATE_V  0x1
#define I2S_TX_UPDATE_S  8

/* I2S_TX_BIG_ENDIAN : R/W ;bitpos:[7] ;default: 1'b0 ; */

/* Description: I2S Tx byte endian,
 * 1: low addr value to high addr.
 * 0: low addr with low addr value.
 */

#define I2S_TX_BIG_ENDIAN    (BIT(7))
#define I2S_TX_BIG_ENDIAN_M  (BIT(7))
#define I2S_TX_BIG_ENDIAN_V  0x1
#define I2S_TX_BIG_ENDIAN_S  7

/* I2S_TX_CHAN_EQUAL : R/W ;bitpos:[6] ;default: 1'b0 ; */

/* Description:
 * 1: The value of Left channel data is equal to the value of right
 * channel data in I2S TX mono mode or TDM channel select mode.
 * 0: The invalid channel data is reg_i2s_single_data in I2S TX mono
 * mode or TDM channel select mode.
 */

#define I2S_TX_CHAN_EQUAL    (BIT(6))
#define I2S_TX_CHAN_EQUAL_M  (BIT(6))
#define I2S_TX_CHAN_EQUAL_V  0x1
#define I2S_TX_CHAN_EQUAL_S  6

/* I2S_TX_MONO : R/W ;bitpos:[5] ;default: 1'b0 ; */

/* Description: Set this bit to enable transmitter in mono mode. */

#define I2S_TX_MONO    (BIT(5))
#define I2S_TX_MONO_M  (BIT(5))
#define I2S_TX_MONO_V  0x1
#define I2S_TX_MONO_S  5

/* I2S_TX_SLAVE_MOD : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: Set this bit to enable slave transmitter mode. */

#define I2S_TX_SLAVE_MOD    (BIT(3))
#define I2S_TX_SLAVE_MOD_M  (BIT(3))
#define I2S_TX_SLAVE_MOD_V  0x1
#define I2S_TX_SLAVE_MOD_S  3

/* I2S_TX_START : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: Set this bit to start transmitting data. */

#define I2S_TX_START    (BIT(2))
#define I2S_TX_START_M  (BIT(2))
#define I2S_TX_START_V  0x1
#define I2S_TX_START_S  2

/* I2S_TX_FIFO_RESET : WT ;bitpos:[1] ;default: 1'b0 ; */

/* Description: Set this bit to reset Tx AFIFO. */

#define I2S_TX_FIFO_RESET    (BIT(1))
#define I2S_TX_FIFO_RESET_M  (BIT(1))
#define I2S_TX_FIFO_RESET_V  0x1
#define I2S_TX_FIFO_RESET_S  1

/* I2S_TX_RESET : WT ;bitpos:[0] ;default: 1'b0 ; */

/* Description: Set this bit to reset transmitter. */

#define I2S_TX_RESET    (BIT(0))
#define I2S_TX_RESET_M  (BIT(0))
#define I2S_TX_RESET_V  0x1
#define I2S_TX_RESET_S  0

