apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_i2s.h
#define I2S_RX_CONF1_REG(i)          (REG_I2S_BASE(i) + 0x28)

/* I2S_RX_MSB_SHIFT : R/W ;bitpos:[29] ;default: 1'b1 ; */

/* Description: Set this bit to enable receiver in Phillips
 * standard mode.
 */

#define I2S_RX_MSB_SHIFT    (BIT(29))
#define I2S_RX_MSB_SHIFT_M  (BIT(29))
#define I2S_RX_MSB_SHIFT_V  0x1
#define I2S_RX_MSB_SHIFT_S  29

/* I2S_RX_TDM_CHAN_BITS : R/W ;bitpos:[28:24] ;default: 5'hf ; */

/* Description: The Rx bit number for each channel minus 1in TDM mode. */

#define I2S_RX_TDM_CHAN_BITS    0x0000001F
#define I2S_RX_TDM_CHAN_BITS_M  ((I2S_RX_TDM_CHAN_BITS_V)<<(I2S_RX_TDM_CHAN_BITS_S))
#define I2S_RX_TDM_CHAN_BITS_V  0x1F
#define I2S_RX_TDM_CHAN_BITS_S  24

/* I2S_RX_HALF_SAMPLE_BITS : R/W ;bitpos:[23:18] ;default: 6'hf ; */

/* Description: I2S Rx half sample bits -1. */

#define I2S_RX_HALF_SAMPLE_BITS    0x0000003F
#define I2S_RX_HALF_SAMPLE_BITS_M  ((I2S_RX_HALF_SAMPLE_BITS_V)<<(I2S_RX_HALF_SAMPLE_BITS_S))
#define I2S_RX_HALF_SAMPLE_BITS_V  0x3F
#define I2S_RX_HALF_SAMPLE_BITS_S  18

/* I2S_RX_BITS_MOD : R/W ;bitpos:[17:13] ;default: 5'hf ; */

/* Description: Set the bits to configure the valid data bit length
 * of I2S receiver channel.
 * 7: all the valid channel data is in 8-bit-mode.
 * 15: all the valid channel data is in 16-bit-mode.
 * 23: all the valid channel data is in 24-bit-mode.
 * 31:all the valid channel data is in 32-bit-mode.
 */

#define I2S_RX_BITS_MOD    0x0000001F
#define I2S_RX_BITS_MOD_M  ((I2S_RX_BITS_MOD_V)<<(I2S_RX_BITS_MOD_S))
#define I2S_RX_BITS_MOD_V  0x1F
#define I2S_RX_BITS_MOD_S  13

/* I2S_RX_BCK_DIV_NUM : R/W ;bitpos:[12:7] ;default: 6'd6 ; */

/* Description: Bit clock configuration bits in receiver mode. */

#define I2S_RX_BCK_DIV_NUM    0x0000003F
#define I2S_RX_BCK_DIV_NUM_M  ((I2S_RX_BCK_DIV_NUM_V)<<(I2S_RX_BCK_DIV_NUM_S))
#define I2S_RX_BCK_DIV_NUM_V  0x3F
#define I2S_RX_BCK_DIV_NUM_S  7

/* I2S_RX_TDM_WS_WIDTH : R/W ;bitpos:[6:0] ;default: 7'h0 ; */

/* Description:  The width of rx_ws_out in TDM mode is
 * (I2S_RX_TDM_WS_WIDTH[6:0] +1) * T_bck.
 */

#define I2S_RX_TDM_WS_WIDTH    0x0000007F
#define I2S_RX_TDM_WS_WIDTH_M  ((I2S_RX_TDM_WS_WIDTH_V)<<(I2S_RX_TDM_WS_WIDTH_S))
#define I2S_RX_TDM_WS_WIDTH_V  0x7F
#define I2S_RX_TDM_WS_WIDTH_S  0

#define I2S_TX_CONF1_REG(i)          (REG_I2S_BASE(i) + 0x2C)

/* I2S_TX_BCK_NO_DLY : R/W ;bitpos:[30] ;default: 1'b1 ; */

/* Description:
 * 1: BCK is not delayed to generate pos/neg edge in master mode.
 * 0: BCK is delayed to generate pos/neg edge in master mode.
 */

#define I2S_TX_BCK_NO_DLY    (BIT(30))
#define I2S_TX_BCK_NO_DLY_M  (BIT(30))
#define I2S_TX_BCK_NO_DLY_V  0x1
#define I2S_TX_BCK_NO_DLY_S  30

/* I2S_TX_MSB_SHIFT : R/W ;bitpos:[29] ;default: 1'b1 ; */

/* Description: Set this bit to enable transmitter in Phillips
 * standard mode.
 */

#define I2S_TX_MSB_SHIFT    (BIT(29))
#define I2S_TX_MSB_SHIFT_M  (BIT(29))
#define I2S_TX_MSB_SHIFT_V  0x1
#define I2S_TX_MSB_SHIFT_S  29

/* I2S_TX_TDM_CHAN_BITS : R/W ;bitpos:[28:24] ;default: 5'hf ; */

/* Description: The Tx bit number for each channel minus 1in TDM mode. */

#define I2S_TX_TDM_CHAN_BITS    0x0000001F
#define I2S_TX_TDM_CHAN_BITS_M  ((I2S_TX_TDM_CHAN_BITS_V)<<(I2S_TX_TDM_CHAN_BITS_S))
#define I2S_TX_TDM_CHAN_BITS_V  0x1F
#define I2S_TX_TDM_CHAN_BITS_S  24

/* I2S_TX_HALF_SAMPLE_BITS : R/W ;bitpos:[23:18] ;default: 6'hf ; */

/* Description:  I2S Tx half sample bits -1. */

#define I2S_TX_HALF_SAMPLE_BITS    0x0000003F
#define I2S_TX_HALF_SAMPLE_BITS_M  ((I2S_TX_HALF_SAMPLE_BITS_V)<<(I2S_TX_HALF_SAMPLE_BITS_S))
#define I2S_TX_HALF_SAMPLE_BITS_V  0x3F
#define I2S_TX_HALF_SAMPLE_BITS_S  18

/* I2S_TX_BITS_MOD : R/W ;bitpos:[17:13] ;default: 5'hf ; */

/* Description:
 * Set the bits to configure the valid data bit length of I2S transmitter
 * channel.
 * 7: all the valid channel data is in 8-bit-mode.
 * 15: all the valid channel data is in 16-bit-mode.
 * 23: all the valid channel data is in 24-bit-mode.
 * 31:all the valid channel data is in 32-bit-mode.
 */

#define I2S_TX_BITS_MOD    0x0000001F
#define I2S_TX_BITS_MOD_M  ((I2S_TX_BITS_MOD_V)<<(I2S_TX_BITS_MOD_S))
#define I2S_TX_BITS_MOD_V  0x1F
#define I2S_TX_BITS_MOD_S  13

/* I2S_TX_BCK_DIV_NUM : R/W ;bitpos:[12:7] ;default: 6'd6 ; */

/* Description: Bit clock configuration bits in transmitter mode. */

#define I2S_TX_BCK_DIV_NUM    0x0000003F
#define I2S_TX_BCK_DIV_NUM_M  ((I2S_TX_BCK_DIV_NUM_V)<<(I2S_TX_BCK_DIV_NUM_S))
#define I2S_TX_BCK_DIV_NUM_V  0x3F
#define I2S_TX_BCK_DIV_NUM_S  7

/* I2S_TX_TDM_WS_WIDTH : R/W ;bitpos:[6:0] ;default: 7'h0 ; */

/* Description:
 * The width of tx_ws_out in TDM mode is:
 * (I2S_TX_TDM_WS_WIDTH[6:0] +1) * T_bck.
 */

#define I2S_TX_TDM_WS_WIDTH    0x0000007F
#define I2S_TX_TDM_WS_WIDTH_M  ((I2S_TX_TDM_WS_WIDTH_V)<<(I2S_TX_TDM_WS_WIDTH_S))
#define I2S_TX_TDM_WS_WIDTH_V  0x7F
#define I2S_TX_TDM_WS_WIDTH_S  0

#define I2S_RX_CLKM_CONF_REG(i)          (REG_I2S_BASE(i) + 0x30)

/* I2S_MCLK_SEL : R/W ;bitpos:[29] ;default: 1'b0 ; */

/* Description:
 * 0: Use I2S Tx module clock as I2S_MCLK_OUT.
 * 1: Use I2S Rx module clock as I2S_MCLK_OUT.
 */

#define I2S_MCLK_SEL    (BIT(29))
#define I2S_MCLK_SEL_M  (BIT(29))
#define I2S_MCLK_SEL_V  0x1
#define I2S_MCLK_SEL_S  29

/* I2S_RX_CLK_SEL : R/W ;bitpos:[28:27] ;default: 2'b0 ; */

/* Description:
 * Select I2S Rx module source clock.
 * 0: no clock.
 * 1: APLL.
 * 2: CLK160,
 * 3: I2S_MCLK_in.
 */

#define I2S_RX_CLK_SEL    0x00000003
#define I2S_RX_CLK_SEL_M  ((I2S_RX_CLK_SEL_V)<<(I2S_RX_CLK_SEL_S))
#define I2S_RX_CLK_SEL_V  0x3
#define I2S_RX_CLK_SEL_S  27

/* I2S_RX_CLK_ACTIVE : R/W ;bitpos:[26] ;default: 1'b0 ; */

/* Description: I2S Rx module clock enable signal. */

#define I2S_RX_CLK_ACTIVE    (BIT(26))
#define I2S_RX_CLK_ACTIVE_M  (BIT(26))
#define I2S_RX_CLK_ACTIVE_V  0x1
#define I2S_RX_CLK_ACTIVE_S  26

/* I2S_RX_CLKM_DIV_NUM : R/W ;bitpos:[7:0] ;default: 8'd2 ; */

/* Description: Integral I2S clock divider value. */

#define I2S_RX_CLKM_DIV_NUM    0x000000FF
#define I2S_RX_CLKM_DIV_NUM_M  ((I2S_RX_CLKM_DIV_NUM_V)<<(I2S_RX_CLKM_DIV_NUM_S))
#define I2S_RX_CLKM_DIV_NUM_V  0xFF
#define I2S_RX_CLKM_DIV_NUM_S  0

#define I2S_TX_CLKM_CONF_REG(i)          (REG_I2S_BASE(i) + 0x34)

/* I2S_CLK_EN : R/W ;bitpos:[29] ;default: 1'b0 ; */

/* Description: Set this bit to enable clk gate. */

