apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_i2s.h
/* I2S_TX_TDM_CHAN10_EN : R/W ;bitpos:[10] ;default: 1'h1 ; */

/* Description:
 * 1: Enable the valid data output of I2S TX TDM channel $n.
 * 0:  Disable, just output 0 in this channel..
 */

#define I2S_TX_TDM_CHAN10_EN    (BIT(10))
#define I2S_TX_TDM_CHAN10_EN_M  (BIT(10))
#define I2S_TX_TDM_CHAN10_EN_V  0x1
#define I2S_TX_TDM_CHAN10_EN_S  10

/* I2S_TX_TDM_CHAN9_EN : R/W ;bitpos:[9] ;default: 1'h1 ; */

/* Description:
 * 1: Enable the valid data output of I2S TX TDM channel $n.
 * 0:  Disable, just output 0 in this channel.
 */

#define I2S_TX_TDM_CHAN9_EN    (BIT(9))
#define I2S_TX_TDM_CHAN9_EN_M  (BIT(9))
#define I2S_TX_TDM_CHAN9_EN_V  0x1
#define I2S_TX_TDM_CHAN9_EN_S  9

/* I2S_TX_TDM_CHAN8_EN : R/W ;bitpos:[8] ;default: 1'h1 ; */

/* Description:
 * 1: Enable the valid data output of I2S TX TDM channel $n.
 * 0:  Disable, just output 0 in this channel.
 */

#define I2S_TX_TDM_CHAN8_EN    (BIT(8))
#define I2S_TX_TDM_CHAN8_EN_M  (BIT(8))
#define I2S_TX_TDM_CHAN8_EN_V  0x1
#define I2S_TX_TDM_CHAN8_EN_S  8

/* I2S_TX_TDM_CHAN7_EN : R/W ;bitpos:[7] ;default: 1'h1 ; */

/* Description:
 * 1: Enable the valid data output of I2S TX TDM channel $n.
 * 0:  Disable, just output 0 in this channel.
 */

#define I2S_TX_TDM_CHAN7_EN    (BIT(7))
#define I2S_TX_TDM_CHAN7_EN_M  (BIT(7))
#define I2S_TX_TDM_CHAN7_EN_V  0x1
#define I2S_TX_TDM_CHAN7_EN_S  7

/* I2S_TX_TDM_CHAN6_EN : R/W ;bitpos:[6] ;default: 1'h1 ; */

/* Description:
 * 1: Enable the valid data output of I2S TX TDM channel $n.
 * 0:  Disable, just output 0 in this channel.
 */

#define I2S_TX_TDM_CHAN6_EN    (BIT(6))
#define I2S_TX_TDM_CHAN6_EN_M  (BIT(6))
#define I2S_TX_TDM_CHAN6_EN_V  0x1
#define I2S_TX_TDM_CHAN6_EN_S  6

/* I2S_TX_TDM_CHAN5_EN : R/W ;bitpos:[5] ;default: 1'h1 ; */

/* Description:
 * 1: Enable the valid data output of I2S TX TDM channel $n.
 * 0:  Disable, just output 0 in this channel.
 */

#define I2S_TX_TDM_CHAN5_EN    (BIT(5))
#define I2S_TX_TDM_CHAN5_EN_M  (BIT(5))
#define I2S_TX_TDM_CHAN5_EN_V  0x1
#define I2S_TX_TDM_CHAN5_EN_S  5

/* I2S_TX_TDM_CHAN4_EN : R/W ;bitpos:[4] ;default: 1'h1 ; */

/* Description:
 * 1: Enable the valid data output of I2S TX TDM channel $n.
 * 0:  Disable, just output 0 in this channel..
 */

#define I2S_TX_TDM_CHAN4_EN    (BIT(4))
#define I2S_TX_TDM_CHAN4_EN_M  (BIT(4))
#define I2S_TX_TDM_CHAN4_EN_V  0x1
#define I2S_TX_TDM_CHAN4_EN_S  4

/* I2S_TX_TDM_CHAN3_EN : R/W ;bitpos:[3] ;default: 1'h1 ; */

/* Description:
 * 1: Enable the valid data output of I2S TX TDM channel $n.
 * 0:  Disable, just output 0 in this channel..
 */

#define I2S_TX_TDM_CHAN3_EN    (BIT(3))
#define I2S_TX_TDM_CHAN3_EN_M  (BIT(3))
#define I2S_TX_TDM_CHAN3_EN_V  0x1
#define I2S_TX_TDM_CHAN3_EN_S  3

/* I2S_TX_TDM_CHAN2_EN : R/W ;bitpos:[2] ;default: 1'h1 ; */

/* Description:
 * 1: Enable the valid data output of I2S TX TDM channel $n.
 * 0:  Disable, just output 0 in this channel..
 */

#define I2S_TX_TDM_CHAN2_EN    (BIT(2))
#define I2S_TX_TDM_CHAN2_EN_M  (BIT(2))
#define I2S_TX_TDM_CHAN2_EN_V  0x1
#define I2S_TX_TDM_CHAN2_EN_S  2

/* I2S_TX_TDM_CHAN1_EN : R/W ;bitpos:[1] ;default: 1'h1 ; */

/* Description:
 * 1: Enable the valid data output of I2S TX TDM channel $n.
 * 0:  Disable, just output 0 in this channel..
 */

#define I2S_TX_TDM_CHAN1_EN    (BIT(1))
#define I2S_TX_TDM_CHAN1_EN_M  (BIT(1))
#define I2S_TX_TDM_CHAN1_EN_V  0x1
#define I2S_TX_TDM_CHAN1_EN_S  1

/* I2S_TX_TDM_CHAN0_EN : R/W ;bitpos:[0] ;default: 1'h1 ; */

/* Description:
 * 1: Enable the valid data output of I2S TX TDM channel $n.
 * 0:  Disable, just output 0 in this channel.
 */

#define I2S_TX_TDM_CHAN0_EN    (BIT(0))
#define I2S_TX_TDM_CHAN0_EN_M  (BIT(0))
#define I2S_TX_TDM_CHAN0_EN_V  0x1
#define I2S_TX_TDM_CHAN0_EN_S  0

#define I2S_RX_TIMING_REG(i)          (REG_I2S_BASE(i) + 0x58)

/* I2S_RX_BCK_IN_DM : R/W ;bitpos:[29:28] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S Rx BCK input signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used..
 */

#define I2S_RX_BCK_IN_DM    0x00000003
#define I2S_RX_BCK_IN_DM_M  ((I2S_RX_BCK_IN_DM_V)<<(I2S_RX_BCK_IN_DM_S))
#define I2S_RX_BCK_IN_DM_V  0x3
#define I2S_RX_BCK_IN_DM_S  28

/* I2S_RX_WS_IN_DM : R/W ;bitpos:[25:24] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S Rx WS input signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used.
 */

#define I2S_RX_WS_IN_DM    0x00000003
#define I2S_RX_WS_IN_DM_M  ((I2S_RX_WS_IN_DM_V)<<(I2S_RX_WS_IN_DM_S))
#define I2S_RX_WS_IN_DM_V  0x3
#define I2S_RX_WS_IN_DM_S  24

/* I2S_RX_BCK_OUT_DM : R/W ;bitpos:[21:20] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S Rx BCK output signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used..
 */

#define I2S_RX_BCK_OUT_DM    0x00000003
#define I2S_RX_BCK_OUT_DM_M  ((I2S_RX_BCK_OUT_DM_V)<<(I2S_RX_BCK_OUT_DM_S))
#define I2S_RX_BCK_OUT_DM_V  0x3
#define I2S_RX_BCK_OUT_DM_S  20

/* I2S_RX_WS_OUT_DM : R/W ;bitpos:[17:16] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S Rx WS output signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used.
 */

#define I2S_RX_WS_OUT_DM    0x00000003
#define I2S_RX_WS_OUT_DM_M  ((I2S_RX_WS_OUT_DM_V)<<(I2S_RX_WS_OUT_DM_S))
#define I2S_RX_WS_OUT_DM_V  0x3
#define I2S_RX_WS_OUT_DM_S  16

/* I2S_RX_SD3_IN_DM : R/W ;bitpos:[13:12] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S Rx SD3 input signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used.
 */

#define I2S_RX_SD3_IN_DM    0x00000003
#define I2S_RX_SD3_IN_DM_M  ((I2S_RX_SD3_IN_DM_V)<<(I2S_RX_SD3_IN_DM_S))
#define I2S_RX_SD3_IN_DM_V  0x3
#define I2S_RX_SD3_IN_DM_S  12

/* I2S_RX_SD2_IN_DM : R/W ;bitpos:[9:8] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S Rx SD2 input signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used.
 */

#define I2S_RX_SD2_IN_DM    0x00000003
#define I2S_RX_SD2_IN_DM_M  ((I2S_RX_SD2_IN_DM_V)<<(I2S_RX_SD2_IN_DM_S))
#define I2S_RX_SD2_IN_DM_V  0x3
#define I2S_RX_SD2_IN_DM_S  8

