apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_i2s.h
/* I2S_RX_SD1_IN_DM : R/W ;bitpos:[5:4] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S Rx SD1 input signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used.
 */

#define I2S_RX_SD1_IN_DM    0x00000003
#define I2S_RX_SD1_IN_DM_M  ((I2S_RX_SD1_IN_DM_V)<<(I2S_RX_SD1_IN_DM_S))
#define I2S_RX_SD1_IN_DM_V  0x3
#define I2S_RX_SD1_IN_DM_S  4

/* I2S_RX_SD_IN_DM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S Rx SD input signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used.
 */

#define I2S_RX_SD_IN_DM    0x00000003
#define I2S_RX_SD_IN_DM_M  ((I2S_RX_SD_IN_DM_V)<<(I2S_RX_SD_IN_DM_S))
#define I2S_RX_SD_IN_DM_V  0x3
#define I2S_RX_SD_IN_DM_S  0

#define I2S_TX_TIMING_REG(i)          (REG_I2S_BASE(i) + 0x5C)

/* I2S_TX_BCK_IN_DM : R/W ;bitpos:[29:28] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S TX BCK input signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used..
 */

#define I2S_TX_BCK_IN_DM    0x00000003
#define I2S_TX_BCK_IN_DM_M  ((I2S_TX_BCK_IN_DM_V)<<(I2S_TX_BCK_IN_DM_S))
#define I2S_TX_BCK_IN_DM_V  0x3
#define I2S_TX_BCK_IN_DM_S  28

/* I2S_TX_WS_IN_DM : R/W ;bitpos:[25:24] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S TX WS input signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used..
 */

#define I2S_TX_WS_IN_DM    0x00000003
#define I2S_TX_WS_IN_DM_M  ((I2S_TX_WS_IN_DM_V)<<(I2S_TX_WS_IN_DM_S))
#define I2S_TX_WS_IN_DM_V  0x3
#define I2S_TX_WS_IN_DM_S  24

/* I2S_TX_BCK_OUT_DM : R/W ;bitpos:[21:20] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S TX BCK output signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used.
 */

#define I2S_TX_BCK_OUT_DM    0x00000003
#define I2S_TX_BCK_OUT_DM_M  ((I2S_TX_BCK_OUT_DM_V)<<(I2S_TX_BCK_OUT_DM_S))
#define I2S_TX_BCK_OUT_DM_V  0x3
#define I2S_TX_BCK_OUT_DM_S  20

/* I2S_TX_WS_OUT_DM : R/W ;bitpos:[17:16] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S TX WS output signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used..
 */

#define I2S_TX_WS_OUT_DM    0x00000003
#define I2S_TX_WS_OUT_DM_M  ((I2S_TX_WS_OUT_DM_V)<<(I2S_TX_WS_OUT_DM_S))
#define I2S_TX_WS_OUT_DM_V  0x3
#define I2S_TX_WS_OUT_DM_S  16

/* I2S_TX_SD1_OUT_DM : R/W ;bitpos:[5:4] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S TX SD1 output signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used..
 */

#define I2S_TX_SD1_OUT_DM    0x00000003
#define I2S_TX_SD1_OUT_DM_M  ((I2S_TX_SD1_OUT_DM_V)<<(I2S_TX_SD1_OUT_DM_S))
#define I2S_TX_SD1_OUT_DM_V  0x3
#define I2S_TX_SD1_OUT_DM_S  4

/* I2S_TX_SD_OUT_DM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */

/* Description:
 * The delay mode of I2S TX SD output signal.
 * 0: bypass.
 * 1: delay by pos edge.
 * 2: delay by neg edge.
 * 3: not used..
 */

#define I2S_TX_SD_OUT_DM    0x00000003
#define I2S_TX_SD_OUT_DM_M  ((I2S_TX_SD_OUT_DM_V)<<(I2S_TX_SD_OUT_DM_S))
#define I2S_TX_SD_OUT_DM_V  0x3
#define I2S_TX_SD_OUT_DM_S  0

#define I2S_LC_HUNG_CONF_REG(i)          (REG_I2S_BASE(i) + 0x60)

/* I2S_LC_FIFO_TIMEOUT_ENA : R/W ;bitpos:[11] ;default: 1'b1 ; */

/* Description: The enable bit for FIFO timeout. */

#define I2S_LC_FIFO_TIMEOUT_ENA    (BIT(11))
#define I2S_LC_FIFO_TIMEOUT_ENA_M  (BIT(11))
#define I2S_LC_FIFO_TIMEOUT_ENA_V  0x1
#define I2S_LC_FIFO_TIMEOUT_ENA_S  11

/* I2S_LC_FIFO_TIMEOUT_SHIFT : R/W ;bitpos:[10:8] ;default: 3'b0 ; */

/* Description:
 * The bits are used to scale tick counter threshold. The tick counter
 * is reset when counter value >= 88000/2^i2s_lc_fifo_timeout_shift.
 */

#define I2S_LC_FIFO_TIMEOUT_SHIFT    0x00000007
#define I2S_LC_FIFO_TIMEOUT_SHIFT_M  ((I2S_LC_FIFO_TIMEOUT_SHIFT_V)<<(I2S_LC_FIFO_TIMEOUT_SHIFT_S))
#define I2S_LC_FIFO_TIMEOUT_SHIFT_V  0x7
#define I2S_LC_FIFO_TIMEOUT_SHIFT_S  8

/* I2S_LC_FIFO_TIMEOUT : R/W ;bitpos:[7:0] ;default: 8'h10 ; */

/* Description:
 * The i2s_tx_hung_int interrupt or the i2s_rx_hung_int interrupt will be
 * triggered when fifo hung counter is equal to this value.
 */

#define I2S_LC_FIFO_TIMEOUT    0x000000FF
#define I2S_LC_FIFO_TIMEOUT_M  ((I2S_LC_FIFO_TIMEOUT_V)<<(I2S_LC_FIFO_TIMEOUT_S))
#define I2S_LC_FIFO_TIMEOUT_V  0xFF
#define I2S_LC_FIFO_TIMEOUT_S  0

#define I2S_RXEOF_NUM_REG(i)          (REG_I2S_BASE(i) + 0x64)

/* I2S_RX_EOF_NUM : R/W ;bitpos:[11:0] ;default: 12'h40 ; */

/* Description:
 * The receive data bit length is
 * (I2S_RX_BITS_MOD[4:0] + 1) * (REG_RX_EOF_NUM[11:0] + 1). It will trigger
 * in_suc_eof interrupt in the configured DMA RX channel.
 */

#define I2S_RX_EOF_NUM    0x00000FFF
#define I2S_RX_EOF_NUM_M  ((I2S_RX_EOF_NUM_V)<<(I2S_RX_EOF_NUM_S))
#define I2S_RX_EOF_NUM_V  0xFFF
#define I2S_RX_EOF_NUM_S  0

#define I2S_CONF_SIGLE_DATA_REG(i)          (REG_I2S_BASE(i) + 0x68)

/* I2S_SINGLE_DATA : R/W ;bitpos:[31:0] ;default: 32'd0 ; */

/* Description: The configured constant channel data to be sent out. */

#define I2S_SINGLE_DATA    0xFFFFFFFF
#define I2S_SINGLE_DATA_M  ((I2S_SINGLE_DATA_V)<<(I2S_SINGLE_DATA_S))
#define I2S_SINGLE_DATA_V  0xFFFFFFFF
#define I2S_SINGLE_DATA_S  0

#define I2S_STATE_REG(i)          (REG_I2S_BASE(i) + 0x6C)

/* I2S_TX_IDLE : RO ;bitpos:[0] ;default: 1'b1 ; */

/* Description:
 * 1: i2s_tx is idle state.
 * 0: i2s_tx is working..
 */

#define I2S_TX_IDLE    (BIT(0))
#define I2S_TX_IDLE_M  (BIT(0))
#define I2S_TX_IDLE_V  0x1
#define I2S_TX_IDLE_S  0

#define I2S_DATE_REG(i)          (REG_I2S_BASE(i) + 0x80)

/* I2S_DATE : R/W ;bitpos:[27:0] ;default: 28'h2009070 ; */

/* Description: I2S version control register. */

#define I2S_DATE    0x0FFFFFFF
#define I2S_DATE_M  ((I2S_DATE_V)<<(I2S_DATE_S))
#define I2S_DATE_V  0xFFFFFFF
#define I2S_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_I2S_H */
